In [1]:
import pandas as pd

In [3]:
user_header = ['user_id', 'age', 'gender', 'occupation', 'zip-code']
movieusers = pd.read_table('../data-repo/movieusers.txt', sep='|',  names=user_header, index_col='user_id')

movieusers.head()

         age gender  occupation zip-code
user_id
1         24      M  technician    85711
2         53      F       other    94043
3         23      M      writer    32067
4         24      M  technician    43537
5         33      F       other    15213

In [4]:
movieusers.shape

(943, 4)

In [7]:
movieusers['zip-code'].duplicated().sum()

148

In [8]:
movieusers.duplicated().sum()

7

In [10]:
# 定位重复行
movieusers.loc[movieusers.duplicated(keep='first'), :]

         age gender occupation zip-code
user_id
496       21      F    student    55414
572       51      M   educator    20003
621       17      M    student    60402
684       28      M    student    55414
733       44      F      other    60630
805       27      F      other    20009
890       32      M    student    97301

In [11]:
# 删除重复行
movieusers.drop_duplicates(keep='first').shape

(936, 4)

In [13]:
# 只匹配特定列的重复数据
movieusers.duplicated(subset=['age', 'zip-code']).sum()

882

In [15]:
# 只删除特定匹配列的重复数据
movieusers.drop_duplicates(subset=['age', 'zip-code']).shape

(927, 4)